# -*- coding: utf-8 -*-
"""
Basic module to search for correct response on user's request.
All search logic is here.

"""

__author__ = 'mayns'


def process_request(req):
    return [(115, u'Если друг твой самый лучший\nПоскользнулся и упал,\nПокажи на друга пальцем\nИ хватайся за живот.\n'
                  u'Пусть он видит, лежа в луже, —\nТы ничуть не огорчен.\nНастоящий друг не любит\n'
                  u'Огорчать своих друзей.'), (45, u'Если вы еще не твердо\nВ жизни выбрали дорогу\n'
                                                   u'И не знаете, с чего бы\nТрудовой свой путь начать,\n'
                                                   u'Бейте лампочки в подъездах —\nЛюди скажут вам «спасибо».\n'
                                                   u'Вы поможете народу\nЭлектричество беречь.')]